Revit 2027 API
PanelScheduleTemplate.IsDataPanelSchedule Property
 Checks to see if this object is data panel schedule template element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDataPanelSchedule { get; }
Public ReadOnly Property IsDataPanelSchedule As Boolean
	Get
public:
property bool IsDataPanelSchedule {
	bool get ();
}
member IsDataPanelSchedule : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace